openfoam/OpenFOAM-dev/tutorials/multiRegion/film/cylinderVoF/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s VoF blockMesh -region VoF

runApplication decomposePar -region VoF -noFields

runParallel extrudeToRegionMesh -region VoF -overwrite

runApplication -s fields decomposePar -fields -copyZero

runParallel $(getApplication)

runApplication reconstructPar -allRegions

printf "\n%s\n" "Creating files for paraview post-processing"
paraFoam -touchAll
echo

#------------------------------------------------------------------------------
